Revit 2027 API
View.TemporaryViewModes Property
 Data of temporary view modes associated with this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TemporaryViewModes TemporaryViewModes { get; }
Public ReadOnly Property TemporaryViewModes As TemporaryViewModes
	Get
public:
property TemporaryViewModes^ TemporaryViewModes {
	TemporaryViewModes^ get ();
}
member TemporaryViewModes : TemporaryViewModes with get
Property Value
TemporaryViewModes
Remarks
 Temporary view modes are available in graphic views only.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace